Revit 2027 API
PointRelativeToPoint.GetHostPointReference Method
Get a copy of the host point reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetHostPointReference()
Public Function GetHostPointReference As Reference
public:
Reference^ GetHostPointReference()
member GetHostPointReference : unit -> Reference
Return Value
Reference
See Also
Reference
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace